/*
 Navicat Premium Data Transfer

 Source Server         : 本地
 Source Server Type    : MySQL
 Source Server Version : 50723
 Source Host           : localhost:3306
 Source Schema         : test

 Target Server Type    : MySQL
 Target Server Version : 50723
 File Encoding         : 65001

 Date: 25/08/2019 13:39:35
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Records of 
-- ----------------------------
BEGIN;
INSERT INTO `erp_dict` VALUES ('BZG', '包装工', 0, NULL, NULL, '2019-05-30 09:25:55', NULL, NULL, 5, 0), ('CJG', '裁剪工', 0, NULL, NULL, '2019-05-30 09:25:32', NULL, NULL, 5, 0), ('FDG', '缝边工', 0, NULL, NULL, '2019-05-30 09:27:03', NULL, NULL, 5, 0);
COMMIT;

-- ----------------------------
-- Records of 
-- ----------------------------
BEGIN;
INSERT INTO `erp_menu` VALUES (5, NULL, 0, '用户管理', '/user', 'role-3', 0, 0, NULL, NULL, NULL, NULL, '2019-05-24 23:38:32', 'admin', '2019-08-25 13:37:13', 0), (6, 5, 0, '角色管理', 'role', 'role-4', 0, 0, NULL, NULL, NULL, NULL, '2019-05-24 23:38:51', 'admin', '2019-08-25 13:37:35', 0), (11, 52, 1, '删除菜单', '/erp/api/menu/delete', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:12', 'admin', '2019-06-08 09:58:13', 0), (12, 52, 1, '添加菜单', '/erp/api/menu/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:58:17', 0), (13, 52, 1, '修改菜单', '/erp/api/menu/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:58:22', 0), (14, 6, 1, '修改角色', '/erp/api/role/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:58:34', 0), (15, 6, 1, '删除角色', '/erp/api/role/deletes', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:58:40', 0), (16, 6, 1, '添加角色', '/erp/api/role/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:58:47', 0), (17, 49, 1, '添加用户', '/erp/api/user/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:58:53', 0), (18, 49, 1, '修改用户', '/erp/api/user/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:58:58', 0), (19, 49, 1, '删除用户', '/erp/api/user/deletes', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 17:03:13', 'admin', '2019-06-08 09:59:03', 0), (20, 53, 1, '新建文章', '/erp/api/essay/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 19:21:21', 'admin', '2019-06-08 10:00:36', 0), (21, 53, 1, '修改文章', '/erp/api/essay/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 21:45:36', 'admin', '2019-06-08 10:00:54', 0), (22, 53, 1, '删除文章', '/erp/api/essay/deletes', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-05-27 21:45:36', 'admin', '2019-06-08 10:00:58', 0), (40, 54, 1, '新增字典', '/erp/api/dict/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 10:01:44', 0), (41, 54, 1, '修改字典', '/erp/api/dict/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 10:01:48', 0), (42, 54, 1, '删除字典', '/erp/api/dict/deletes', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 10:01:55', 0), (43, 50, 1, '新增子系统', '/erp/api/sys/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 09:56:31', 0), (44, 50, 1, '修改子系统', '/erp/api/sys/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 09:56:35', 0), (45, 50, 1, '删除子系统', '/erp/api/sys/delete', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 09:56:41', 0), (46, 51, 1, '新增供应商', '/erp/api/trade/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 09:57:22', 0), (47, 51, 1, '修改供应商', '/erp/api/trade/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 09:57:26', 0), (48, 51, 1, '删除供应商', '/erp/api/trade/deletes', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-08 09:44:14', 'admin', '2019-06-08 09:57:31', 0), (49, 5, 0, '帐号管理', 'account', 'user-1', 0, 0, NULL, NULL, NULL, 'admin', '2019-06-08 09:55:01', 'admin', '2019-08-25 13:37:43', 0), (50, NULL, 0, '子系统管理', '/system', 'example', 0, 0, NULL, NULL, NULL, 'admin', '2019-06-08 09:56:18', 'admin', '2019-08-08 21:31:40', 0), (51, NULL, 0, '供应商管理', '/supplier', 'supply-2', 0, 0, NULL, NULL, NULL, 'admin', '2019-06-08 09:57:13', 'admin', '2019-08-08 21:32:14', 0), (52, NULL, 0, '菜单管理', '/menu', 'menu-10', 0, 0, NULL, NULL, NULL, 'admin', '2019-06-08 09:58:04', 'admin', '2019-08-11 10:42:33', 0), (53, NULL, 0, '文章管理', '/article', 'order', 0, 0, NULL, NULL, NULL, 'admin', '2019-06-08 10:00:27', 'admin', '2019-08-08 21:40:36', 0), (54, NULL, 0, '字典管理', '/dict', 'dict-2', 0, 0, NULL, NULL, NULL, 'admin', '2019-06-08 10:01:32', 'admin', '2019-08-08 21:40:53', 0), (55, 56, 1, '查询工资列表', '/erp/api/user/salary/page', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-06-29 16:39:07', NULL, '2019-06-29 16:44:49', 0), (56, NULL, 0, '工资管理', '/salary', 'salary-2', 0, 0, NULL, NULL, NULL, NULL, '2019-06-29 16:44:37', 'admin', '2019-08-08 21:42:53', 0), (57, 60, 1, '新增产品', '/erp/api/inventory/add', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-07-27 16:05:01', 'admin', '2019-07-27 16:08:02', 0), (58, 60, 1, '修改产品', '/erp/api/inventory/update', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-07-27 16:05:01', 'admin', '2019-07-27 16:08:09', 0), (59, 60, 1, '删除产品', '/erp/api/inventory/deletes', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-07-27 16:05:01', 'admin', '2019-07-27 16:08:15', 0), (60, NULL, 0, '库存管理', '/inventory', 'tag', 0, 0, NULL, NULL, NULL, NULL, '2019-07-27 16:05:01', 'admin', '2019-08-08 00:05:18', 0), (61, NULL, 0, '订单管理', '/order', 'order-2', 0, 0, NULL, NULL, NULL, 'admin', '2019-08-08 00:01:39', NULL, NULL, 0), (62, NULL, 0, '报表管理', '/report', 'report-3', 0, 0, NULL, NULL, NULL, 'admin', '2019-08-08 00:02:25', NULL, NULL, 0), (63, 60, 1, '查看库存列表', '/erp/api/inventory/page', NULL, 0, 0, NULL, NULL, NULL, NULL, '2019-08-10 01:03:12', 'admin', '2019-08-25 13:08:31', 0), (64, 61, 1, '添加订单', 'erp/order/add', '', 0, 0, NULL, NULL, NULL, 'admin', '2019-08-16 23:49:43', NULL, NULL, 0), (65, 61, 1, '编辑订单', 'erp/order/edit', '', 0, 0, NULL, NULL, NULL, 'admin', '2019-08-16 23:50:06', NULL, NULL, 0), (66, 61, 1, '订单详情', 'erp/order/detail', '', 0, 0, NULL, NULL, NULL, 'admin', '2019-08-16 23:50:38', NULL, NULL, 0);
COMMIT;

-- ----------------------------
-- Records of 
-- ----------------------------
BEGIN;
INSERT INTO `erp_role` VALUES (9, '超级管理员', 0, NULL, '2019-05-26 18:14:24', NULL, '2019-08-16 23:51:15', 0), (10, '管理员', 0, NULL, '2019-05-26 18:15:01', NULL, '2019-08-25 13:25:14', 0);
COMMIT;

-- ----------------------------
-- Records of 
-- ----------------------------
BEGIN;
INSERT INTO `erp_role_menu` VALUES (9, 5, 'admin', '2019-08-16 23:51:15'), (9, 6, 'admin', '2019-08-16 23:51:15'), (9, 11, 'admin', '2019-08-16 23:51:15'), (9, 12, 'admin', '2019-08-16 23:51:15'), (9, 13, 'admin', '2019-08-16 23:51:15'), (9, 14, 'admin', '2019-08-16 23:51:15'), (9, 15, 'admin', '2019-08-16 23:51:15'), (9, 16, 'admin', '2019-08-16 23:51:15'), (9, 17, 'admin', '2019-08-16 23:51:15'), (9, 18, 'admin', '2019-08-16 23:51:15'), (9, 19, 'admin', '2019-08-16 23:51:15'), (9, 20, 'admin', '2019-08-16 23:51:15'), (9, 21, 'admin', '2019-08-16 23:51:15'), (9, 22, 'admin', '2019-08-16 23:51:15'), (9, 40, 'admin', '2019-08-16 23:51:15'), (9, 41, 'admin', '2019-08-16 23:51:15'), (9, 42, 'admin', '2019-08-16 23:51:15'), (9, 43, 'admin', '2019-08-16 23:51:15'), (9, 44, 'admin', '2019-08-16 23:51:15'), (9, 45, 'admin', '2019-08-16 23:51:15'), (9, 46, 'admin', '2019-08-16 23:51:15'), (9, 47, 'admin', '2019-08-16 23:51:15'), (9, 48, 'admin', '2019-08-16 23:51:15'), (9, 49, 'admin', '2019-08-16 23:51:15'), (9, 50, 'admin', '2019-08-16 23:51:15'), (9, 51, 'admin', '2019-08-16 23:51:15'), (9, 52, 'admin', '2019-08-16 23:51:15'), (9, 53, 'admin', '2019-08-16 23:51:15'), (9, 54, 'admin', '2019-08-16 23:51:15'), (9, 55, 'admin', '2019-08-16 23:51:15'), (9, 56, 'admin', '2019-08-16 23:51:15'), (9, 57, 'admin', '2019-08-16 23:51:15'), (9, 58, 'admin', '2019-08-16 23:51:15'), (9, 59, 'admin', '2019-08-16 23:51:15'), (9, 60, 'admin', '2019-08-16 23:51:15'), (9, 61, 'admin', '2019-08-16 23:51:15'), (9, 62, 'admin', '2019-08-16 23:51:15'), (9, 64, 'admin', '2019-08-16 23:51:15'), (9, 65, 'admin', '2019-08-16 23:51:15'), (9, 66, 'admin', '2019-08-16 23:51:15'), (10, 5, 'admin', '2019-08-25 13:25:14'), (10, 6, 'admin', '2019-08-25 13:25:14'), (10, 14, 'admin', '2019-08-25 13:25:14'), (10, 15, 'admin', '2019-08-25 13:25:14'), (10, 16, 'admin', '2019-08-25 13:25:14'), (10, 17, 'admin', '2019-08-25 13:25:14'), (10, 18, 'admin', '2019-08-25 13:25:14'), (10, 19, 'admin', '2019-08-25 13:25:14'), (10, 20, 'admin', '2019-08-25 13:25:14'), (10, 21, 'admin', '2019-08-25 13:25:14'), (10, 22, 'admin', '2019-08-25 13:25:14'), (10, 40, 'admin', '2019-08-25 13:25:14'), (10, 41, 'admin', '2019-08-25 13:25:14'), (10, 42, 'admin', '2019-08-25 13:25:14'), (10, 46, 'admin', '2019-08-25 13:25:14'), (10, 47, 'admin', '2019-08-25 13:25:14'), (10, 48, 'admin', '2019-08-25 13:25:14'), (10, 49, 'admin', '2019-08-25 13:25:14'), (10, 51, 'admin', '2019-08-25 13:25:14'), (10, 53, 'admin', '2019-08-25 13:25:14'), (10, 54, 'admin', '2019-08-25 13:25:14'), (10, 55, 'admin', '2019-08-25 13:25:14'), (10, 56, 'admin', '2019-08-25 13:25:14'), (10, 57, 'admin', '2019-08-25 13:25:14'), (10, 58, 'admin', '2019-08-25 13:25:14'), (10, 59, 'admin', '2019-08-25 13:25:14'), (10, 60, 'admin', '2019-08-25 13:25:14'), (10, 61, 'admin', '2019-08-25 13:25:14'), (10, 62, 'admin', '2019-08-25 13:25:14'), (10, 63, 'admin', '2019-08-25 13:25:14'), (10, 64, 'admin', '2019-08-25 13:25:14'), (10, 65, 'admin', '2019-08-25 13:25:14'), (10, 66, 'admin', '2019-08-25 13:25:14');
COMMIT;

-- ----------------------------
-- Records of 
-- ----------------------------
BEGIN;
INSERT INTO `erp_type` VALUES (5, '工种');
COMMIT;

-- ----------------------------
-- Records of 
-- ----------------------------
BEGIN;
INSERT INTO `erp_user` VALUES ('admin', 0, '202cb962ac59075b964b07152d234b70', '陈小风', 0, NULL, '15625059409', NULL, NULL, NULL, '2019-05-26 18:16:45', NULL, NULL, '2000', NULL, 0, NULL, NULL, 0.30);
COMMIT;

-- ----------------------------
-- Records of 
-- ----------------------------
BEGIN;
INSERT INTO `erp_user_role` VALUES ('admin', 0, 9);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
